# AIM 5001 Module 11 Assignment (100 Points)
Nosson Weissman <br>
AIM 5003: Module 11 assignment
## Part 1: Tidying and Reshaping Data

- Upload the provided M11_Data.csv file to your online AIM 5001 GitHub repository.
- Using the pd.read_csv() function, read the M11_Data.csv file from your GitHub repository into a 
Jupyter Notebook WITHOUT removing any empty rows or columns from the content of the file.

In [4]:
import pandas as pd
import numpy as np

data_filepath = 'https://raw.githubusercontent.com/codepharmer/AIM-5001/main/Module_11/M11_Data%20(1).csv'

flights_df = pd.read_csv(data_filepath)

The content of the resulting dataframe should appear as follows:

In [13]:
flights_df

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497.0,221.0,212.0,503.0,1841.0
1,NaN,delayed,62.0,12.0,20.0,102.0,305.0
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AMWEST,on time,694.0,4840.0,383.0,320.0,201.0
4,NaN,delayed,117.0,415.0,65.0,129.0,61.0

**1.1 (30 Points)**: Use your knowledge of combining and reshaping data in Pandas to tidy and transform/reshape 
the data contained within the dataframe. To get started, think about how you would want the data to appear 
if it were converted to “long” format, e.g., how would you define a “single observation” for the data shown in 
the graphic?; How many key values are associated with each data value?; How many columns should your long 
format structure contain based on the information provided in the graphic shown above?; What would the 
column headings for the long structure be?; etc. Use your answers to these questions to guide your 
reshaping/transformational work on the data. Your reshaping/transformational steps must include 
converting the above table to a “tidy” long format. Additional transformational steps (e.g., filling in missing 2
data values, renaming columns, etc.) should be performed as needed to ensure that your data is, in fact, 
“tidy”.

In [43]:
cities = ['Los Angeles', 'Phoenix', 'San Diego', 'San Francisco', 'Seattle']
columns = ['Unnamed: 0', 'Unnamed: 1']
#convert the original wide to long using melt method
long_flights = flights_df.melt(id_vars=columns, value_vars = cities)
new_cols = ['id', 'airline', 'status', 'city', 'count']
long_flights.rename(columns={'Unnamed: 0': 'airline', 'Unnamed: 1':'status', 'variable':'city', 'value':'count'}, inplace=True)
#fill na airlines with last seen airline
long_flights['airline'].fillna(method='ffill', inplace = True)
#remove observations with 'na' flight status
long_flights = long_flights[long_flights['status'].notna()]
long_flights

   airline   status           city   count
0   ALASKA  on time    Los Angeles   497.0
1   ALASKA  delayed    Los Angeles    62.0
3   AMWEST  on time    Los Angeles   694.0
4   AMWEST  delayed    Los Angeles   117.0
5   ALASKA  on time        Phoenix   221.0
6   ALASKA  delayed        Phoenix    12.0
8   AMWEST  on time        Phoenix  4840.0
9   AMWEST  delayed        Phoenix   415.0
10  ALASKA  on time      San Diego   212.0
11  ALASKA  delayed      San Diego    20.0
13  AMWEST  on time      San Diego   383.0
14  AMWEST  delayed      San Diego    65.0
15  ALASKA  on time  San Francisco   503.0
16  ALASKA  delayed  San Francisco   102.0
18  AMWEST  on time  San Francisco   320.0
19  AMWEST  delayed  San Francisco   129.0
20  ALASKA  on time        Seattle  1841.0
21  ALASKA  delayed        Seattle   305.0
23  AMWEST  on time        Seattle   201.0
24  AMWEST  delayed        Seattle    61.0

**1.2 (15 Points)** Using your reshaped/transformed data, perform analysis to compare the arrival delays for the 
two airlines. Two questions you must answer: For each city, which airline had the best on time performance?; 
Which airline had the best overall on time performance?; etc. Feel free to define and answer additional 
questions of your own choosing

In [132]:
df = long_flights
# df = df.groupby(['city', 'airline', 'status'])
# df.max(df['count'])
total_count = 0
on_time_count_by_airline = {}
for city in cities:
    index_of_best_performing_airline_by_city = df[(df.city == city) & (df.status == 'on time')]['count'].idxmax()
    row = df[(df.index == index_of_best_performing_airline_by_city)][['city', 'airline', 'status', 'count']]
    display(row)
#     total_count += row['count']
# print(total_count)
# df.max(df[(df.city == city) & (df.status == 'on time')], level='count')
# df
# pd.DataFrame(rows)
# rows

          city airline   status  count
3  Los Angeles  AMWEST  on time  694.0

      city airline   status   count
8  Phoenix  AMWEST  on time  4840.0

         city airline   status  count
13  San Diego  AMWEST  on time  383.0

             city airline   status  count
15  San Francisco  ALASKA  on time  503.0

       city airline   status   count
20  Seattle  ALASKA  on time  1841.0

3   NaN
Name: count, dtype: float64

**1.3 (15 Points)** Finally, given your “tidy” long format structure, consider what, if any, changes you would make 
to the visual presentation of the data if you were then asked to transform your “long” data back into a “wide” 
format: would you mimic the structure of the graphic shown above? If not, how might you transform your 
“long” data to “wide” format to make its “wide” presentation easier to understand and work with? Provide an 
example of your recommendation.

In [129]:
count_arr = np.array(long_flights['count'])
count_arr_long = count_arr.reshape((10,2))
df = pd.DataFrame(count_arr_long,
                     index=[['Alaska', 'Alaska','Alaska', 'Alaska', 'Alaska',
                             'AMWEST','AMWEST','AMWEST','AMWEST','AMWEST'],
                            ['Los Angeles', 'Phoenix', 'San Diego', 'San Francisco', 'Seattle',
                             'Los Angeles', 'Phoenix', 'San Diego', 'San Francisco', 'Seattle']],
                     columns=['on time','delayed'])
df

                      on time  delayed
Alaska Los Angeles      497.0     62.0
       Phoenix          694.0    117.0
       San Diego        221.0     12.0
       San Francisco   4840.0    415.0
       Seattle          212.0     20.0
AMWEST Los Angeles      383.0     65.0
       Phoenix          503.0    102.0
       San Diego        320.0    129.0
       San Francisco   1841.0    305.0
       Seattle          201.0     61.0

____________________________
## Part 2: Using Your GroupBy and Data Aggregation Skills

Three Short Coding Challenges
Can you complete these three tasks using no more than 17 lines of code in total? <br>

These coding challenges will give you a chance to exercise your GroupBy/Aggregation/Split-ApplyCombine skills based on your readings from Chapter 10 of the "Python for Data Analytics" textbook. See if 
you can answer these three questions using no more than 17 total lines of Python code.
For each of the three questions you will be making use of the Pittsburgh Bridges data 
set: https://archive.ics.uci.edu/ml/datasets/Pittsburgh+Bridges. (Links to an external site.) Upload the 
provided briges.data.version1.csv to your online AIM 5001 GitHub repository and then read the file from 
GitHub into your local Python environment

**2.1 (12 Points):** You’ve been asked to generate a quick report that tells us how many bridges of each 
‘Purpose’/’Material’ grouping within the data set have been constructed over each of the rivers listed in the 
data set. For each river, your output should include the Purpose, Material, and count (aka ‘How Many?’), 
similar to the output shown in the graphic below for River 'A', and your report should include similar content 
for each of the rivers contained within the data set.3
You are allowed to use no more than three (3) lines of Python/Pandas code to generate this report in its 
entirety (i.e., you MUST produce the results for all of the rivers at once) and you MUST use Pandas’ groupby 
and/or aggregation functionality to accomplish the task. Be sure to include a brief narrative explaining how 
your proposed code would accomplish the task.

**2.2 (14 Points):** You’ve been asked to generate a second report that shows the average length for each 
‘Purpose’/’Material’ bridge grouping within the data set. As you should recall from our previous work with the 
Pittsburgh Bridges data set, the ‘Length’ attribute is not provided to us in a numeric format and also contains 
many missing values. As such, you should clean up the contents of that column and convert it to numeric 
format before attempting to generate your report. The output of your report should appear as shown in the 
graphic below.
You are allowed to use no more than four (4) lines of Python/Pandas code AFTER you’ve finished cleaning up 
the ‘Length’ column (which should take no more than 2-3 lines of code) and you MUST use Pandas’ groupby 
and/or aggregation functionality to accomplish the task. Be sure to include a brief narrative explaining how 
your proposed code would accomplish the task.

**2.3 (14 Points)** Finally, you’ve been asked to generate one last report that shows the average length, count, 
minimum length, and maximum length of bridges built during 4 equal length time periods (1818 – 1860; 1860-
1902; 1902-1944; 1944-1986). The output of your report should appear as shown in the graphic below.4
You are allowed to use no more than seven (7) lines of Python/Pandas code and you must use Pandas’ 
groupby and/or aggregation functionality to accomplish the task. Be sure to include a brief narrative 
explaining how your proposed code would accomplish the task.
Save all of your work for this assignment within a single Jupyter Notebook and upload / submit it within the 
provided M11 Assignment Canvas submission portal. Be sure to save your Notebook using the following 
nomenclature: first initial_last name_M11_assn" (e.g., J_Smith_M11_assn).